org/main/20211027151914-discrete_mathematics.org
:PROPERTIES:
:ID:       0D39BCE8-E112-4DA4-A4B8-2091E1426B46
:ROAM_REFS:
:END:
#+title: Discrete Mathematics
#+HUGO_SECTION:main
* Number Systems
** Natural Numbers
*** Closed under addtition
any 2 num in N add get 1 num in N
*** Key property
Any natural number can be obtained from 0
by S(n) = n + 1
S(0) = 1, S(S(0) = 2; =induction= !!
** Integers
and negative
*** Even and odd
0 = undefined
** Rational Numbers
x/y where x and y belong to Integers
** Real numbers
all decimal numbers
Distances to points on a number line
** Prinme Numbers

* Perrin Numbers
* Proof Techiniques
** Proof by Induction
:PROPERTIES:
:ID:       5151E7FA-03EE-4834-AC78-E609748D2E73
:END:
*** Flow
**** 1. Bace Case
property holds for ~n = 0~
or ~n = b~
**** 2. Inductive Step
Assume n = m is ture ==> n = m + 1 is true
**** 3. Conclusion

** Contradiction

*** Flow

**** 1. Assumption by contradiction

**** 2. Develop the proof

**** 3. Find self conflict\
=This is a contradiction so the suusmption must be wrong=
* Set Theory
** Notations
*** Relative complement -
*** The complement ~
Complement of a set A is:
U([[Universal set]]) - A
*** Uniersal set
the big set in probelm
*** Symmetric difference
no collapse, all other.
*** Power Set
Pow(A) = {C|C<A}
**** Observaton
Pow(A intersect B)= Pow(A) intersact Pow(B)
does not hold for union
*** Cardinality |A|
**** Union
|A U B|=|A|+|B|-|A intersact B|
*** Cartesian Product x
A x B ={(a,b)|a E A and b E B}

** Problem sheet [0/8]
+ [ ] Notation for sets
+ [ ] Subset?
+ [ ] equal of sets?
+ [ ] Operations
+ [ ] Algebra
+ [ ] Cardinality[ ]  produt
+ [ ] [ ] Bit strings

* Relations
Relation over sets?
(a,b), a from A, b from B

** Definition
between A and B:a subset R of A x B
When A = B, R is a binary relation on A

** Properties

*** Reflexive
xRx for all x
*** Transitive
xRy and yRz => xRz
*** Symmetric


xRy => yRx
**** Anti symmetric
xRy => yRx => x=y
a.k.a {(1,1)} is both Symmetric and antisymmetric

** Equivalence Relations
A relation that is reflexive transitive and symmetric
*** Equivalent class Ex
The set related to x
E0 = Z
E1 = {0,1,2,3,4,5,6,7,8,9,...}
** Partial order
+ binary relation R
+ reflexive
+ transitive
+ antisymmetric
<= >=
** Total order
partial order that is neither this or that.
** Relational closures
R on S may not have a property like reflexivity etc.

can extend the reltion so that it does have some properties
*** Reflexcive closure
Add (x,x)
New relation is called the reflexive closure of R
*** Symmetric closure
Add every (x,y) (y,x)
** Path
Vertex a to vertex b

path with same start and end vertex is a circuit or cycle

length of path is number of edges

** Transitive Closure
have all recachable vertex in the graph from any vertex of any length

made in repeats
*** Property
R* is transitive
R belongs to R*
S is transitive relation on A nad R belongs to S, then R* belongs to 
** Problem sheet [0/7]
+ [ ] Definition
+ [ ] Binary relation representation
+ [ ] Unary relations
+ [ ] Properties of Binary relations
+ [ ] =Transitive closure=
+ [ ] Eauivalence relations adn partitions
+ [ ] =Partial orders= and total orders
* Functions
* Logic and Spec ification Languages
* Propositional Logic
* First Order Logic
facts ==> world
including:
+ [ ] Objects
+ Relation
+ Functions
* Combinatorics
** Problem sheet
+ [ ] natotions for sums and products, including the factorial function.
+ [ ] Principles for counting permutations and combinations
* Probability and Statistics
Test $\forall \epsilon > 0$
* Universal set
